---
kind: property
id: P:Autodesk.Revit.DB.Category.IsVisibleInUI
source: html/96b2f714-dcff-3272-58c9-f7dbaf982d01.htm
---
# Autodesk.Revit.DB.Category.IsVisibleInUI Property

Identifies if the category is visible to the user and should be displayed in UI.

## Syntax (C#)
```csharp
public bool IsVisibleInUI { get; }
```